mas =  [621, 445, 147, 159, 430, 222, 482, 44, 194, 522, 652, 494, 14, 126, 532, 387, 
        441, 471, 337, 446, 18, 36, 202, 574, 556, 458, 16, 139, 222, 220, 107, 82, 264, 
        366, 501, 319, 314, 430, 55, 336]

#узнать количество элементов в массиве
puts mas.length

#перевернуть массив
puts mas.reverse

#найти наибольшее число
puts mas.max

#найти наименьшее число
puts mas.min

#отсортировать от меньшего к большему
puts mas.sort

#отсортировать от большего к меньшему
puts mas.sort.reverse
